# =============================================================================
# Brewfile — Homebrew packages, casks, and fonts
# =============================================================================

# --- CLI Tools ---------------------------------------------------------------
brew "cocoapods"       # Dependency manager for Cocoa projects
brew "gh"              # GitHub command-line tool
brew "node"            # JavaScript runtime
brew "postgresql@18"   # Object-relational database
brew "tree"            # Directory tree visualization

# --- Cask Apps (installed via Homebrew, self-update after) -------------------
cask "alt-tab"              # Windows-like alt-tab
cask "appcleaner"           # Application uninstaller
cask "bartender"            # Menu bar manager
cask "betterdisplay"        # Display management
cask "claude"               # Claude desktop app
cask "figma"                # Design tool
cask "gcloud-cli"           # Google Cloud SDK
cask "github"               # GitHub Desktop
cask "google-chrome"        # Browser
cask "grandperspective"     # Disk usage visualization
cask "linear-linear"        # Project management
cask "linearmouse"          # Mouse customization
cask "miniconda"            # Python environment manager
cask "notion"               # Notes & docs
cask "notion-calendar"      # Calendar
cask "raycast"              # Launcher
cask "slack"                # Communication
cask "spotify"              # Music
cask "toggl-track"          # Time tracking
cask "visual-studio-code"   # Code editor
